---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BRepBuilderEdgeGeometry Properties
BRepBuilderEdgeGeometry Class See Also Send Feedback
---

The BRepBuilderEdgeGeometry type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderEdgeGeometry Class

Autodesk.Revit.DB Namespace